ELPasEDT/src/Documents/РапортТеплосетевоеОборудование/РапортТеплосетевоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РапортТеплосетевоеОборудование</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВБакахКонденсата1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВБакахКонденсата2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВБакахКонденсата3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВБакахКонденсата4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВБакахКонденсата5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>ГруппаОборудования</name>
      <type>
        <types>CatalogRef.ГруппыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя1</name>
      <type>
        <types>EnumRef.СостоянияТеплосетевогоОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя2</name>
      <type>
        <types>EnumRef.СостоянияТеплосетевогоОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя3</name>
      <type>
        <types>EnumRef.СостоянияТеплосетевогоОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя4</name>
      <type>
        <types>EnumRef.СостоянияТеплосетевогоОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя5</name>
      <type>
        <types>EnumRef.СостоянияТеплосетевогоОборудования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Catalogs/ГруппыОборудования/ГруппыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыОборудования</name>
  <predefined>
    <items>
      <name>ВК</name>
      <description>ВК</description>
    </items>
    <items>
      <name>ОБ</name>
      <description>ОБ</description>
    </items>
    <items>
      <name>ПБ</name>
      <description>ПБ</description>
    </items>
    <items>
      <name>ПРРОУ</name>
      <description>ПРРОУ</description>
    </items>
    <items>
      <name>РОУ</name>
      <description>РОУ</description>
    </items>
    <items>
      <name>РРОУ</name>
      <description>РРОУ</description>
    </items>
  </predefined>
</mdclass:Catalog>

ELPasEDT/src/Documents/РапортТеплосетевоеОборудование/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Организация = ПолучитьОрганизациюПользователя(ТекущийПользователь.Подразделение);
		Ответственный = ТекущийПользователь;
		Подразделение = ТекущийПользователь.Подразделение;
		
		ЗаполнитьТабЧасть();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОрганизациюПользователя(Подразделение) 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Организация КАК Организация
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка = &Подразделение
		|	И НЕ Подразделения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Организация;
	Иначе 
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьТабЧасть()
	
	Структура = ОперативныйЖурнал.ПолучитьСтруктуруОрганизаций();
	
	Список = Новый СписокЗначений;
	
	Если Организация = Структура.ИжевскаяТЭЦ1 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОборудования.Ссылка КАК ГруппаОборудования,
		|	ВЫБОР
		|		КОГДА ГруппыОборудования.Ссылка = &ОБ
		|			ТОГДА 1
		|		КОГДА ГруппыОборудования.Ссылка = &ПБ
		|			ТОГДА 2
		|		КОГДА ГруппыОборудования.Ссылка = &ВК
		|			ТОГДА 3
		|		КОГДА ГруппыОборудования.Ссылка = &РОУ
		|			ТОГДА 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.ГруппыОборудования КАК ГруппыОборудования
		|ГДЕ
		|	ГруппыОборудования.Ссылка В(&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
		Список.Добавить(Справочники.ГруппыОборудования.ОБ);
		Список.Добавить(Справочники.ГруппыОборудования.ПБ);
		Список.Добавить(Справочники.ГруппыОборудования.ВК);
		Список.Добавить(Справочники.ГруппыОборудования.РОУ);
		
		Запрос.УстановитьПараметр("Список", Список);
		Запрос.УстановитьПараметр("ОБ", 	Справочники.ГруппыОборудования.ОБ);
		Запрос.УстановитьПараметр("ПБ", 	Справочники.ГруппыОборудования.ПБ);
		Запрос.УстановитьПараметр("ВК", 	Справочники.ГруппыОборудования.ВК);
		Запрос.УстановитьПараметр("РОУ", 	Справочники.ГруппыОборудования.РОУ);
		
		ЗначенияПоказателей.Загрузить(Запрос.Выполнить().Выгрузить());
						
	ИначеЕсли Организация = Структура.ИжевскаяТЭЦ2 Тогда 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОборудования.Ссылка КАК ГруппаОборудования,
		|	ВЫБОР
		|		КОГДА ГруппыОборудования.Ссылка = &ОБ
		|			ТОГДА 1
		|		КОГДА ГруппыОборудования.Ссылка = &ПБ
		|			ТОГДА 2
		|		КОГДА ГруппыОборудования.Ссылка = &ВК
		|			ТОГДА 3
		|		КОГДА ГруппыОборудования.Ссылка = &РОУ
		|			ТОГДА 4
		|		КОГДА ГруппыОборудования.Ссылка = &РРОУ
		|			ТОГДА 5
		|		КОГДА ГруппыОборудования.Ссылка = &ПРРОУ
		|			ТОГДА 6
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.ГруппыОборудования КАК ГруппыОборудования
		|ГДЕ
		|	ГруппыОборудования.Ссылка В(&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";

		Список.Добавить(Справочники.ГруппыОборудования.ОБ);
		Список.Добавить(Справочники.ГруппыОборудования.ПБ);
		Список.Добавить(Справочники.ГруппыОборудования.ВК);
		Список.Добавить(Справочники.ГруппыОборудования.РОУ);
		Список.Добавить(Справочники.ГруппыОборудования.РРОУ);
		Список.Добавить(Справочники.ГруппыОборудования.ПРРОУ);
		
		Запрос.УстановитьПараметр("Список", Список);
		Запрос.УстановитьПараметр("ОБ", 	Справочники.ГруппыОборудования.ОБ);
		Запрос.УстановитьПараметр("ПБ", 	Справочники.ГруппыОборудования.ПБ);
		Запрос.УстановитьПараметр("ВК", 	Справочники.ГруппыОборудования.ВК);
		Запрос.УстановитьПараметр("РОУ", 	Справочники.ГруппыОборудования.РОУ);
		Запрос.УстановитьПараметр("РРОУ", 	Справочники.ГруппыОборудования.РРОУ);
		Запрос.УстановитьПараметр("ПРРОУ", 	Справочники.ГруппыОборудования.ПРРОУ);

		Запрос.УстановитьПараметр("Список", Список);
		
		ЗначенияПоказателей.Загрузить(Запрос.Выполнить().Выгрузить());

		
	КонецЕсли;
	
КонецФункции
